*1*. データの読み込み
- 各種CSVデータを読み込んでください
- 各種データフレーム名はsales_df、member_dfとしてください

In [216]:
import pandas as pd

sales_df = pd.read_csv('Sales_Data.csv')
member_df = pd.read_csv('Member_Data.csv')

2. 取引データの上部5行を表示してください

In [217]:
sales_df.head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Amount
0,1,2024/5/1 0:00,21,25,12,3,5820
1,2,2024/5/1 2:55,107,23,17,1,640
2,3,2024/5/1 5:51,117,24,6,3,1270
3,4,2024/5/1 8:47,124,38,1,3,5980
4,5,2024/5/1 11:43,281,28,5,4,9390

3. 会員データの下部5行を表示してください

In [218]:
# LLMが回答
member_df.tail(5)

     Member_ID  Gender  Age  Days_Since_Registration
295        296    Male   41                     1513
296        297  Female   58                     1613
297        298  Female   71                     1177
298        299  Female   38                     1660
299        300  Female   50                      104

In [219]:
# 自分の回答
# member_df.head(-5)

4. 取引データの各カラムの件数や型を確認してください

In [220]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_ID    1000 non-null   int64
 1   Transaction_Date  1000 non-null   object
 2   Member_ID         1000 non-null   int64
 3   Product_ID        1000 non-null   int64
 4   Store_ID          1000 non-null   int64
 5   Quantity          1000 non-null   int64
 6   Amount            1000 non-null   int64
dtypes: int64(6), object(1)
memory usage: 54.8+ KB

5. 取引データの各種IDのカラムを質的変数に型変換してください。会員データに関しても同様に各種IDを質的変数に型変換してください

In [221]:
member_df.info()

# 一般的にIDは質的変数に変換したほうがいい。
# おそらく、数字の順や大きさにはあまり意味がなく、特定できればいいので、質的変数に変換する。

# sales_dfとmember_dfは、Menber_IDをキーにして結合することができる。これはよくあるらしい。

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Member_ID                300 non-null    int64
 1   Gender                   300 non-null    object
 2   Age                      300 non-null    int64
 3   Days_Since_Registration  300 non-null    int64
dtypes: int64(3), object(1)
memory usage: 9.5+ KB

In [222]:
# LLMが回答
# Convert ID columns in sales_df to categorical type
sales_df['Transaction_ID'] = sales_df['Transaction_ID'].astype('category')
sales_df['Member_ID'] = sales_df['Member_ID'].astype('category')
sales_df['Product_ID'] = sales_df['Product_ID'].astype('category')
sales_df['Store_ID'] = sales_df['Store_ID'].astype('category')

# Convert ID columns in member_df to categorical type
member_df['Member_ID'] = member_df['Member_ID'].astype('category')


# 解答例では、IDをastype("string")としている

In [223]:
sales_df.info(), member_df.info() # Check if the conversion was successful

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_ID    1000 non-null   category
 1   Transaction_Date  1000 non-null   object
 2   Member_ID         1000 non-null   category
 3   Product_ID        1000 non-null   category
 4   Store_ID          1000 non-null   category
 5   Quantity          1000 non-null   int64
 6   Amount            1000 non-null   int64
dtypes: category(4), int64(2), object(1)
memory usage: 83.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Member_ID                300 non-null    category
 1   Gender                   300 non-null    object
 2   Age                      300 non-null    int64
 3   Days_Since_Registration  300 non-null    int64
dtypes: category(1), int64(2), object(1)
memory usage: 18.2+ KB

(None, None)

In [224]:
# member_df['Days_Since_Registration']

6. 日付データをdatetime型に変換してください

In [225]:
sales_df['Transaction_Date'] = pd.to_datetime(sales_df['Transaction_Date'])

7. 取引データの各列の基本的な統計情報（平均、標準偏差など）を表示してください

In [226]:
sales_df.describe()

                    Transaction_Date     Quantity        Amount
count                           1000  1000.000000   1000.000000
mean   2024-06-30 23:59:30.299999744     2.551000   5338.650000
min              2024-05-01 00:00:00     1.000000    510.000000
25%              2024-05-31 11:59:15     2.000000   3022.500000
50%              2024-06-30 23:59:30     3.000000   5250.000000
75%              2024-07-31 11:59:45     4.000000   7752.500000
max              2024-08-31 00:00:00     4.000000  10000.000000
std                              NaN     1.103003   2778.234487

8. カラム名の変更
- データフレームのAmountのカラム名をSales_Amountに変更してください
- データフレームは上書きしないでください

In [227]:
# LLMが回答
sales_df_llm_work = sales_df.rename(columns={'Amount': 'Sales_Amount'})

In [228]:
# 自分で調べた方法
sales_df_my_work = sales_df.copy()
# sales_df['Amount']
sales_df_my_work.columns = ['Transaction_ID', 'Transaction_Date', 'Member_ID', 'Product_ID',
       'Store_ID', 'Quantity', 'Sales_Amount']
sales_df_my_work.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_ID    1000 non-null   category
 1   Transaction_Date  1000 non-null   datetime64[ns]
 2   Member_ID         1000 non-null   category
 3   Product_ID        1000 non-null   category
 4   Store_ID          1000 non-null   category
 5   Quantity          1000 non-null   int64
 6   Sales_Amount      1000 non-null   int64
dtypes: category(4), datetime64[ns](1), int64(2)
memory usage: 83.0 KB

In [229]:
# 二つのやり方を比較
sales_df_llm_work.head()
# print("="*20)
sales_df_my_work.head()

# 両方同じ結果が出たので、どちらでも良い

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5820
1,2,2024-05-01 02:55:00,107,23,17,1,640
2,3,2024-05-01 05:51:00,117,24,6,3,1270
3,4,2024-05-01 08:47:00,124,38,1,3,5980
4,5,2024-05-01 11:43:00,281,28,5,4,9390

9. Amountを100円単位に四捨五入して表示してください

In [230]:
# 自分で調べた方法
sales_df_my_work['Sales_Amount'] = sales_df_my_work['Sales_Amount'].round(-2) # Round to the nearest 100
sales_df_my_work.head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5800
1,2,2024-05-01 02:55:00,107,23,17,1,600
2,3,2024-05-01 05:51:00,117,24,6,3,1300
3,4,2024-05-01 08:47:00,124,38,1,3,6000
4,5,2024-05-01 11:43:00,281,28,5,4,9400

In [231]:
# LLMが回答(同じ結果になった)
sales_df_llm_work['Sales_Amount'] = sales_df_llm_work['Sales_Amount'].round(-2)  # Round to the nearest 100
sales_df_llm_work.head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5800
1,2,2024-05-01 02:55:00,107,23,17,1,600
2,3,2024-05-01 05:51:00,117,24,6,3,1300
3,4,2024-05-01 08:47:00,124,38,1,3,6000
4,5,2024-05-01 11:43:00,281,28,5,4,9400

10. 取引データからAmountが5000円を超える取引を抽出してください

In [232]:
sales_df_my_work[sales_df_my_work['Sales_Amount'] > 5000].head()

# 解答例
sales_df_my_work.query('Sales_Amount > 5000').head()
# 汎用的に使える。よく使う。クエリの中に条件分を入れる。

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5800
3,4,2024-05-01 08:47:00,124,38,1,3,6000
4,5,2024-05-01 11:43:00,281,28,5,4,9400
5,6,2024-05-01 14:39:00,292,21,14,4,8700
6,7,2024-05-01 17:35:00,203,43,5,3,9800

11. 会員データから30歳から50歳の会員を抽出してください

In [233]:
# 自分の回答
# member_df[30 <= member_df['Age'] <= 50].head() # この書き方はエラーになる。条件式は分ける必要がある。

# 自分で調べた方法
# filtered_df = member_df.query('30 <= Age <= 50')
# print(filtered_df) # 同じ結果になる
filtered_df = member_df.loc[(member_df['Age'] >= 30) & (member_df['Age'] <= 50)]
print(filtered_df)

    Member_ID  Gender  Age  Days_Since_Registration
3           4  Female   49                     1881
8           9    Male   48                     1640
9          10  Female   48                     1317
12         13    Male   41                     1855
13         14    Male   33                      928
..        ...     ...  ...                      ...
292       293  Female   35                      388
293       294    Male   32                     1127
295       296    Male   41                     1513
298       299  Female   38                     1660
299       300  Female   50                      104

[114 rows x 4 columns]

In [234]:
# LLMが回答
member_df[(member_df['Age'] >= 30) & (member_df['Age'] <= 50)]

    Member_ID  Gender  Age  Days_Since_Registration
3           4  Female   49                     1881
8           9    Male   48                     1640
9          10  Female   48                     1317
12         13    Male   41                     1855
13         14    Male   33                      928
..        ...     ...  ...                      ...
292       293  Female   35                      388
293       294    Male   32                     1127
295       296    Male   41                     1513
298       299  Female   38                     1660
299       300  Female   50                      104

[114 rows x 4 columns]

12. 取引データから"2024-08-01"以降に行われた取引を抽出してください

In [235]:
# 自分の回答
sales_df_my_work[sales_df_my_work['Transaction_Date'] > '2024-08-01']

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
754,755,2024-08-01 01:55:00,226,17,14,4,8600
755,756,2024-08-01 04:51:00,131,18,18,3,1000
756,757,2024-08-01 07:47:00,76,45,13,3,1900
757,758,2024-08-01 10:42:00,286,29,11,1,4400
758,759,2024-08-01 13:38:00,277,20,16,1,5100
...,...,...,...,...,...,...,...
995,996,2024-08-30 12:16:00,213,33,15,3,8400
996,997,2024-08-30 15:12:00,62,49,19,3,3900
997,998,2024-08-30 18:08:00,49,12,11,4,2500
998,999,2024-08-30 21:04:00,127,11,15,3,4200
999,1000,2024-08-31 00:00:00,223,5,12,2,7500

In [236]:
# LLMの回答
sales_df_llm_work[sales_df_llm_work['Transaction_Date'] >= '2024-08-01'] # >=以外は自分の回答と同じ

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
754,755,2024-08-01 01:55:00,226,17,14,4,8600
755,756,2024-08-01 04:51:00,131,18,18,3,1000
756,757,2024-08-01 07:47:00,76,45,13,3,1900
757,758,2024-08-01 10:42:00,286,29,11,1,4400
758,759,2024-08-01 13:38:00,277,20,16,1,5100
...,...,...,...,...,...,...,...
995,996,2024-08-30 12:16:00,213,33,15,3,8400
996,997,2024-08-30 15:12:00,62,49,19,3,3900
997,998,2024-08-30 18:08:00,49,12,11,4,2500
998,999,2024-08-30 21:04:00,127,11,15,3,4200
999,1000,2024-08-31 00:00:00,223,5,12,2,7500

In [237]:
# 解答例
sales_df_my_work.query("Transaction_Date >= '2024-08-01'")

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
754,755,2024-08-01 01:55:00,226,17,14,4,8600
755,756,2024-08-01 04:51:00,131,18,18,3,1000
756,757,2024-08-01 07:47:00,76,45,13,3,1900
757,758,2024-08-01 10:42:00,286,29,11,1,4400
758,759,2024-08-01 13:38:00,277,20,16,1,5100
...,...,...,...,...,...,...,...
995,996,2024-08-30 12:16:00,213,33,15,3,8400
996,997,2024-08-30 15:12:00,62,49,19,3,3900
997,998,2024-08-30 18:08:00,49,12,11,4,2500
998,999,2024-08-30 21:04:00,127,11,15,3,4200
999,1000,2024-08-31 00:00:00,223,5,12,2,7500

13. Store_ID が「1」または「3」で、かつ Amount が5000円以上の取引を抽出してください

In [238]:
# sales_df_my_work['Store_ID'].nunique()
# sales_df_my_work[(sales_df_my_work['Store_ID'] == 1) | (sales_df_my_work['Store_ID'] == 3) & (sales_df_my_work['Sales_Amount'] >= 5000)]

# 上記のやり方だと、1or3の条件が先に評価されてしまうので、括弧で囲む必要がある。(動きを見ると、&は3にしかかかっていない)
# sales_df_my_work[((sales_df_my_work['Store_ID'] == 1) | (sales_df_my_work['Store_ID'] == 3)) & (sales_df_my_work['Sales_Amount'] >= 5000)]
# また、queryを使うと、括弧を使わなくても、条件を指定できる。
sales_df_my_work.query("(Store_ID == 1 or Store_ID == 3) and Sales_Amount >= 5000")

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
3,4,2024-05-01 08:47:00,124,38,1,3,6000
7,8,2024-05-01 20:30:00,51,18,1,4,5500
17,18,2024-05-03 01:49:00,156,3,1,3,7600
61,62,2024-05-08 10:47:00,50,38,3,4,6500
65,66,2024-05-08 22:30:00,60,49,3,2,5800
86,87,2024-05-11 12:03:00,77,37,1,2,8500
95,96,2024-05-12 14:26:00,167,9,1,3,5400
109,110,2024-05-14 07:28:00,229,49,3,4,9800
129,130,2024-05-16 18:05:00,259,1,1,2,9500
138,139,2024-05-17 20:28:00,116,17,3,1,9800
151,152,2024-05-19 10:34:00,136,17,3,1,8200
188,189,2024-05-23 23:00:00,12,11,1,2,9900
189,190,2024-05-24 01:56:00,239,50,3,3,8000
202,203,2024-05-25 16:02:00,73,9,3,2,6100
210,211,2024-05-26 15:29:00,25,8,1,4,9400
279,280,2024-06-04 01:43:00,133,3,1,4,8200
280,281,2024-06-04 04:39:00,183,14,1,1,5600
287,288,2024-06-05 01:10:00,138,38,1,2,8200
305,306,2024-06-07 05:56:00,52,8,3,2,9400
309,310,2024-06-07 17:39:00,232,29,1,1,8300
313,314,2024-06-08 05:22:00,42,17,3,1,7300
318,319,2024-06-08 20:02:00,192,19,1,3,7400
360,361,2024-06-13 23:08:00,261,26,3,3,6200
392,393,2024-06-17 20:55:00,273,48,3,3,6900
441,442,2024-06-23 20:32:00,118,7,1,4,7000
443,444,2024-06-24 02:24:00,23,13,1,2,9300
446,447,2024-06-24 11:11:00,108,13,3,4,7800
483,484,2024-06-28 23:38:00,111,49,3,1,6800
491,492,2024-06-29 23:05:00,202,38,3,4,8000
492,493,2024-06-30 02:01:00,38,24,3,2,8100
547,548,2024-07-06 19:13:00,90,11,1,3,7800
554,555,2024-07-07 15:44:00,254,22,3,1,8700
615,616,2024-07-15 02:31:00,165,50,3,1,5600
643,644,2024-07-18 12:35:00,2,29,3,2,8600
647,648,2024-07-19 00:18:00,66,43,1,2,8600
701,702,2024-07-25 14:34:00,47,24,3,2,7600
710,711,2024-07-26 16:57:00,114,36,3,4,9700
732,733,2024-07-29 09:26:00,162,10,1,1,8100
775,776,2024-08-03 15:28:00,289,17,3,1,6000
782,783,2024-08-04 11:59:00,201,5,1,1,8300
788,789,2024-08-05 05:34:00,191,19,1,3,8100
797,798,2024-08-06 07:57:00,142,14,1,4,5800
808,809,2024-08-07 16:11:00,46,48,3,4,5100
837,838,2024-08-11 05:11:00,164,23,3,2,9300
845,846,2024-08-12 04:38:00,222,40,1,4,8800
860,861,2024-08-14 00:36:00,158,41,3,3,6600
867,868,2024-08-14 21:07:00,149,25,3,1,8100
873,874,2024-08-15 14:42:00,65,36,3,3,9000
885,886,2024-08-17 01:52:00,276,32,1,3,5800
891,892,2024-08-17 19:27:00,76,10,1,1,6700
946,947,2024-08-24 12:39:00,72,43,1,2,7600
947,948,2024-08-24 15:35:00,109,35,1,1,9100
953,954,2024-08-25 09:10:00,8,4,3,2,7300
968,969,2024-08-27 05:08:00,225,13,3,2,6800

14. Product_ID が「10」、「20」、「30」のいずれかに一致する取引を抽出してください

In [239]:
# 自分の回答
# sales_df_my_work[sales_df_my_work['Product_ID'] in ['10', '20', '30']] # この書き方はエラーになる。inの使い方が間違っている。

# 自分で調べた方法
sales_df_my_work[sales_df_my_work['Product_ID'].isin([10, 20, 30])].head()
# sales_df_my_work.query("Product_ID in [10, 20, 30]").head() # 上記と同じ結果になる

# '10'ではなく、10という部分も間違っていたので、修正

# 解答例
sales_df_my_work.query("Product_ID in [10, 20, 30]").head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
13,14,2024-05-02 14:06:00,52,30,2,1,8600
41,42,2024-05-06 00:10:00,47,20,12,1,3100
44,45,2024-05-06 08:57:00,277,10,10,4,6900
69,70,2024-05-09 10:14:00,164,30,9,3,4600
84,85,2024-05-11 06:11:00,138,30,2,3,1800

In [240]:
# LLMの回答
sales_df_llm_work[sales_df_llm_work['Product_ID'].isin([10, 20, 30])].head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
13,14,2024-05-02 14:06:00,52,30,2,1,8600
41,42,2024-05-06 00:10:00,47,20,12,1,3100
44,45,2024-05-06 08:57:00,277,10,10,4,6900
69,70,2024-05-09 10:14:00,164,30,9,3,4600
84,85,2024-05-11 06:11:00,138,30,2,3,1800

In [241]:
# type(sales_df_my_work['Product_ID'][0])
# sales_df_my_work.info()
# sales_df_my_work['Product_ID'] = sales_df_my_work['Product_ID'].astype(int)

# sales_df_my_work['Product_ID'].dtype # categories_dtype=int64
# sales_df_my_work['Quantity'].dtype # dtype('int64')

15. Product_ID が「10」、「20」、「30」ではない取引を抽出してください

In [242]:
# 自分で調べた方法
sales_df_my_work[~sales_df_my_work['Product_ID'].isin([10, 20, 30])].head()
# sales_df_my_work.query("Product_ID not in [10, 20, 30]").head() # 上記と同じ結果になる

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5800
1,2,2024-05-01 02:55:00,107,23,17,1,600
2,3,2024-05-01 05:51:00,117,24,6,3,1300
3,4,2024-05-01 08:47:00,124,38,1,3,6000
4,5,2024-05-01 11:43:00,281,28,5,4,9400

16. Quantity が最頻値で、かつ Store_ID が「3」の取引を抽出してください

In [243]:
# 自分で調べた方法
# sales_df_my_work['Quantity'].nunique()
# sales_df_my_work['Quantity'].value_counts()
# sales_df_my_work['Quantity'].mode()[0] # 4が最も多い

# [0]とiloc[0]は同じだが可読性向上する

# Quantityの最頻値を求める
mode_quantity = sales_df_my_work['Quantity'].mode().iloc[0]
# 条件に合うデータを抽出
filtered_df = sales_df_my_work[(sales_df_my_work['Quantity'] == mode_quantity) & (sales_df_my_work['Store_ID'] == 3)]
# 結果を表示
print(filtered_df)

    Transaction_ID    Transaction_Date Member_ID Product_ID Store_ID  \
43              44 2024-05-06 06:01:00       118         29        3
61              62 2024-05-08 10:47:00        50         38        3
109            110 2024-05-14 07:28:00       229         49        3
383            384 2024-06-16 18:32:00       269         44        3
446            447 2024-06-24 11:11:00       108         13        3
472            473 2024-06-27 15:23:00        14         44        3
491            492 2024-06-29 23:05:00       202         38        3
710            711 2024-07-26 16:57:00       114         36        3
808            809 2024-08-07 16:11:00        46         48        3
908            909 2024-08-19 21:17:00        93          2        3

     Quantity  Sales_Amount
43          4          4800
61          4          6500
109         4          9800
383         4          4300
446         4          7800
472         4          3500
491         4          8000
710         4          9700
808         4          5100
908         4          2100

In [244]:
# LLMの回答
# Calculate the mode of the Quantity column
quantity_mode = sales_df_llm_work['Quantity'].mode()[0]

# Filter transactions where Quantity is the mode and Store_ID is 3
filtered_transactions = sales_df_llm_work[(sales_df_my_work['Quantity'] == quantity_mode) & (sales_df_llm_work['Store_ID'] == 3)]
print(filtered_transactions)

    Transaction_ID    Transaction_Date Member_ID Product_ID Store_ID  \
43              44 2024-05-06 06:01:00       118         29        3
61              62 2024-05-08 10:47:00        50         38        3
109            110 2024-05-14 07:28:00       229         49        3
383            384 2024-06-16 18:32:00       269         44        3
446            447 2024-06-24 11:11:00       108         13        3
472            473 2024-06-27 15:23:00        14         44        3
491            492 2024-06-29 23:05:00       202         38        3
710            711 2024-07-26 16:57:00       114         36        3
808            809 2024-08-07 16:11:00        46         48        3
908            909 2024-08-19 21:17:00        93          2        3

     Quantity  Sales_Amount
43          4          4800
61          4          6500
109         4          9800
383         4          4300
446         4          7800
472         4          3500
491         4          8000
710         4          9700
808         4          5100
908         4          2100

In [245]:
# 解答例
quantity_mode = sales_df_llm_work['Quantity'].mode()[0]
sales_df_my_work.query("Quantity == @quantity_mode and Store_ID == 3") # @をつけることで、変数を使うことができる

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
43,44,2024-05-06 06:01:00,118,29,3,4,4800
61,62,2024-05-08 10:47:00,50,38,3,4,6500
109,110,2024-05-14 07:28:00,229,49,3,4,9800
383,384,2024-06-16 18:32:00,269,44,3,4,4300
446,447,2024-06-24 11:11:00,108,13,3,4,7800
472,473,2024-06-27 15:23:00,14,44,3,4,3500
491,492,2024-06-29 23:05:00,202,38,3,4,8000
710,711,2024-07-26 16:57:00,114,36,3,4,9700
808,809,2024-08-07 16:11:00,46,48,3,4,5100
908,909,2024-08-19 21:17:00,93,2,3,4,2100

17. Amount が第1四分位から第3四分位の範囲に属する取引を抽出してください

In [246]:
# 自分で調べた方法
# sales_df_my_work['Sales_Amount'].describe()
q1 = sales_df_my_work['Sales_Amount'].quantile(0.25)
q3 = sales_df_my_work['Sales_Amount'].quantile(0.75)

sales_df_my_work[(sales_df_my_work['Sales_Amount'] >= q1) & (sales_df_my_work['Sales_Amount'] <= q3)].head()

# 解答例
q1 = sales_df_my_work['Sales_Amount'].quantile(0.25)
q3 = sales_df_my_work['Sales_Amount'].quantile(0.75)
sales_df_my_work.query("@q1 <= Sales_Amount <= @q3").head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5800
3,4,2024-05-01 08:47:00,124,38,1,3,6000
7,8,2024-05-01 20:30:00,51,18,1,4,5500
10,11,2024-05-02 05:18:00,141,45,9,4,6700
11,12,2024-05-02 08:14:00,275,9,19,4,3700

18. Product_IDとStore_IDは何種類あるか確認してください

In [247]:
sales_df_my_work['Product_ID'].nunique(), sales_df_my_work['Store_ID'].nunique()

(50, 20)

19. 取引データのProduct_ID ごとに Amount の合計を計算してください

In [248]:
sales_df_my_work.groupby('Product_ID')['Sales_Amount'].sum() # LLMで修正
# sales_df_my_work.groupby('Product_ID')['Sales_Amount'].sum().nunique()
# sales_df_my_work.groupby('Product_ID')['Sales_Amount'].nunique()

# メモ
# グループ化: df.groupby('column_name')は、指定された列('column_name')の値に基づいてデータをグループ化します。
# 集計: その後、集計関数（例：sum(), mean(), count()など）を適用して、各グループごとに計算を行います。
# 例：result = df.groupby('category')['value'].sum()
# 'category'列の値でデータをグループ化
# 各グループ内の'value'列の合計を計算

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/956988122.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sales_df_my_work.groupby('Product_ID')['Sales_Amount'].sum() # LLMで修正

Product_ID
1     121600
2      49800
3     110300
4     122600
5      76700
6      84700
7      94200
8     135900
9      72600
10     92100
11    138700
12     63900
13    139300
14     70300
15     68100
16    106200
17    169400
18    109900
19    130500
20     83700
21    111700
22    128400
23    106500
24    114100
25     88800
26    101600
27    102600
28    121200
29    126000
30     85300
31    106100
32    124900
33     58300
34    126300
35    123200
36    172300
37    126400
38    130800
39     77300
40    110600
41    110600
42     77400
43    101800
44     97100
45    148600
46     55500
47    156200
48     78100
49    118700
50    111200
Name: Sales_Amount, dtype: int64

20. Product_ID ごとにQuantityの中央値を計算してください

In [249]:
sales_df_my_work.groupby('Product_ID')['Quantity'].median()

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/293935698.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sales_df_my_work.groupby('Product_ID')['Quantity'].median()

Product_ID
1     2.0
2     2.0
3     3.0
4     2.0
5     3.0
6     3.0
7     2.0
8     2.0
9     3.0
10    3.0
11    3.0
12    3.0
13    2.0
14    3.0
15    2.5
16    3.0
17    2.0
18    3.0
19    2.0
20    3.0
21    2.5
22    3.0
23    2.0
24    2.0
25    3.0
26    2.0
27    2.0
28    3.0
29    3.0
30    3.0
31    3.0
32    3.0
33    3.0
34    3.0
35    3.0
36    3.0
37    3.0
38    3.0
39    3.0
40    2.0
41    2.0
42    3.0
43    2.0
44    2.5
45    3.0
46    2.0
47    2.0
48    2.5
49    3.0
50    2.0
Name: Quantity, dtype: float64

In [250]:
# LLMが回答
sales_df_llm_work.groupby('Product_ID')['Quantity'].median()

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/682049455.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sales_df_llm_work.groupby('Product_ID')['Quantity'].median()

Product_ID
1     2.0
2     2.0
3     3.0
4     2.0
5     3.0
6     3.0
7     2.0
8     2.0
9     3.0
10    3.0
11    3.0
12    3.0
13    2.0
14    3.0
15    2.5
16    3.0
17    2.0
18    3.0
19    2.0
20    3.0
21    2.5
22    3.0
23    2.0
24    2.0
25    3.0
26    2.0
27    2.0
28    3.0
29    3.0
30    3.0
31    3.0
32    3.0
33    3.0
34    3.0
35    3.0
36    3.0
37    3.0
38    3.0
39    3.0
40    2.0
41    2.0
42    3.0
43    2.0
44    2.5
45    3.0
46    2.0
47    2.0
48    2.5
49    3.0
50    2.0
Name: Quantity, dtype: float64

21. Store_ID ごとに平均Amountを集計してください

In [251]:
sales_df_my_work.groupby('Store_ID')['Sales_Amount'].mean()

# sales_df_my_work.groupby('Store_ID')：データフレームをStore_IDでグループ化します。
# ['Amount'].mean()：各グループ（つまり各Store_ID）のAmount列の平均値を計算します。
# 結果はstore_avg_amountというSeriesに格納されます。
# このSeriesのインデックスはStore_IDで、値はそれぞれのStore_IDに対応するAmountの平均になります。

# 結果をより見やすくする
# store_avg_amount_df = sales_df_my_work.groupby('Store_ID')['Sales_Amount'].mean().reset_index()
# store_avg_amount_df.columns = ['Store_ID', 'Average_Amount']
# print(store_avg_amount_df)

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/2556034677.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sales_df_my_work.groupby('Store_ID')['Sales_Amount'].mean()

Store_ID
1     5873.333333
2     4630.952381
3     5507.843137
4     5329.268293
5     5686.363636
6     5361.111111
7     5458.974359
8     5436.065574
9     5619.047619
10    5301.923077
11    4868.000000
12    5602.272727
13    5815.254237
14    5873.333333
15    5585.937500
16    5201.960784
17    4727.536232
18    4885.416667
19    5091.489362
20    5075.000000
Name: Sales_Amount, dtype: float64

22. 会員データの性別 (Gender) ごとに平均年齢を計算してください

In [252]:
member_df.groupby("Gender")["Age"].mean()

Gender
Female    48.945205
Male      53.259740
Name: Age, dtype: float64

23. 会員ごとに平均 Amount を計算してください

In [253]:
# member_df.groupby('Member_ID')['Amount'].mean()
# member_df.info()
# member_df.columns
sales_df_my_work.columns

# 解答例
sales_df_my_work.groupby('Member_ID')['Sales_Amount'].mean()

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/467850245.py:7: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sales_df_my_work.groupby('Member_ID')['Sales_Amount'].mean()

Member_ID
1      5000.000000
2      5900.000000
3      5100.000000
4      2600.000000
5      4525.000000
          ...
295    7833.333333
296    9400.000000
297    5450.000000
298    9400.000000
300    5900.000000
Name: Sales_Amount, Length: 288, dtype: float64

In [254]:
# LLMが回答
average_amount_per_member = sales_df_my_work.groupby('Member_ID')['Sales_Amount'].mean()
print(average_amount_per_member)

Member_ID
1      5000.000000
2      5900.000000
3      5100.000000
4      2600.000000
5      4525.000000
          ...
295    7833.333333
296    9400.000000
297    5450.000000
298    9400.000000
300    5900.000000
Name: Sales_Amount, Length: 288, dtype: float64

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/2437503761.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  average_amount_per_member = sales_df_my_work.groupby('Member_ID')['Sales_Amount'].mean()

24. Transaction_Dateから日付だけ取り出して日付ごとに Amount の合計を集計してください

In [255]:
OnlyDate = sales_df_my_work['Transaction_Date'].dt.date
# OnlyDate.head()
# sales_df_my_work['Transaction_Date'].head()

sum_amount_per_date = sales_df_my_work.groupby(sales_df_my_work['Transaction_Date'].dt.date)['Sales_Amount'].sum()
print(sum_amount_per_date)

Transaction_Date
2024-05-01    55100
2024-05-02    47800
2024-05-03    52000
2024-05-04    38800
2024-05-05    47400
              ...
2024-08-27    42500
2024-08-28    34300
2024-08-29    42800
2024-08-30    44100
2024-08-31     7500
Name: Sales_Amount, Length: 123, dtype: int64

In [256]:
# 解答例
sales_df_my_work['Transaction_Date_yyyyMMdd'] = sales_df_my_work['Transaction_Date'].dt.date
sales_df_my_work.groupby('Transaction_Date_yyyyMMdd')['Sales_Amount'].sum()

Transaction_Date_yyyyMMdd
2024-05-01    55100
2024-05-02    47800
2024-05-03    52000
2024-05-04    38800
2024-05-05    47400
              ...
2024-08-27    42500
2024-08-28    34300
2024-08-29    42800
2024-08-30    44100
2024-08-31     7500
Name: Sales_Amount, Length: 123, dtype: int64

25. 日付ごとに合計のAmountを集計し、合計Amountが小さい順にソートしてください

In [257]:
# Transaction_Date_yyyyMMddがindexになってしまっていたので、reset_indexでindexを振り直す
# というのも、groupbyでindexが消えてしまうから(それごとにまとめるので)
# ただ、今回はcolumnにあったほうが見やすいので、reset_indexを使っている
# reset_indexはデータの構造を綺麗にするためによく使う
sales_df_my_work.groupby('Transaction_Date_yyyyMMdd')['Sales_Amount'].sum().reset_index().sort_values(by='Sales_Amount', ascending=True)
# assending ... 昇順:True, 降順:False

    Transaction_Date_yyyyMMdd  Sales_Amount
122                2024-08-31          7500
51                 2024-06-21         24100
20                 2024-05-21         25200
114                2024-08-23         28200
68                 2024-07-08         28900
..                        ...           ...
39                 2024-06-09         57400
24                 2024-05-25         57600
117                2024-08-26         59800
84                 2024-07-24         60600
67                 2024-07-07         66100

[123 rows x 2 columns]

26. 月ごとに Amount を集計してください

In [258]:
OnlyMonth = sales_df_my_work['Transaction_Date'].dt.month
# OnlyMonth.tail()

sum_amount_per_month = sales_df_my_work.groupby(sales_df_my_work['Transaction_Date'].dt.month)['Sales_Amount'].sum()
print(sum_amount_per_month)

Transaction_Date
5    1374500
6    1282200
7    1355700
8    1325700
Name: Sales_Amount, dtype: int64

In [259]:
# 解答例
sales_df_my_work['Month'] = sales_df_my_work['Transaction_Date'].dt.to_period('M')
sales_df_my_work.groupby('Month')['Sales_Amount'].sum()

Month
2024-05    1374500
2024-06    1282200
2024-07    1355700
2024-08    1325700
Freq: M, Name: Sales_Amount, dtype: int64

In [260]:
# import pandas as pd

# # サンプルデータの作成
# data = {'date': ['2023-01-01', '2023-02-15', '2023-03-20']}
# df = pd.DataFrame(data)

# # 'date'列をdatetime型に変換
# df['date'] = pd.to_datetime(df['date'])

# # 'date'列を月単位の期間に変換
# df['period'] = df['date'].dt.to_period('M')

# print(df)

27. 月ごとのAmountの増減の絶対値を前月と比較して計算してください

In [261]:
# LLMが回答
# Calculate the absolute difference in Sales_Amount between each month
monthly_diff = sum_amount_per_month.diff().abs()

# Drop the first NaN value resulting from the diff() operation
monthly_diff = monthly_diff.dropna()

print(monthly_diff)

Transaction_Date
6    92300.0
7    73500.0
8    30000.0
Name: Sales_Amount, dtype: float64

In [262]:
# 解答例
monthly_sales = sales_df_my_work.groupby('Month')['Sales_Amount'].sum().reset_index()
monthly_sales['Sales_Amount'].diff().abs()

0        NaN
1    92300.0
2    73500.0
3    30000.0
Name: Sales_Amount, dtype: float64

28. 曜日ごとの合計Amountを集計してください

In [263]:
# sales_df_my_work['Transaction_Date'].dt.weekday
DayName = sales_df_my_work['Transaction_Date'].dt.day_name()
sales_df_my_work.groupby(DayName)['Sales_Amount'].sum()

Transaction_Date
Friday       745700
Monday       718500
Saturday     752300
Sunday       765100
Thursday     791900
Tuesday      722500
Wednesday    842100
Name: Sales_Amount, dtype: int64

In [264]:
# 解答例
sales_df_my_work['Day_of_Week'] = sales_df_my_work['Transaction_Date'].dt.day_name()
sales_df_my_work.groupby('Day_of_Week')['Sales_Amount'].sum()

Day_of_Week
Friday       745700
Monday       718500
Saturday     752300
Sunday       765100
Thursday     791900
Tuesday      722500
Wednesday    842100
Name: Sales_Amount, dtype: int64

In [265]:
# 解答例では、カラムにどんどん新しく追加しているが、この方が、ある意味新しい特徴量を増やせていいのかも？
sales_df_my_work.info()

# groupbyについてメモ
# 特徴量エンジニアリング
# 	•	データ分析では、新しい特徴量を作成するために`groupby`が頻繁に使用されます。
# 	•	例: 各顧客の購入回数や平均購入金額を算出し、それを新しい列として追加する。
# 	•	このような操作は、機械学習モデルの性能向上に寄与する特徴量エンジニアリングで重要な役割を果たします。
# データ変換とフィルタリング
# 	•	グループごとに特定の処理（例えば正規化やフィルタリング）を適用することも可能です。
# 	•	例: 各グループ内で値を標準化したり、条件に基づいてデータを抽出したりする。
# まとめ
# Pythonの`groupby`関数は、データ分析や機械学習で非常に重要なツールです。特に「集計」「特徴量作成」「データ変換」の場面で活用され、新しい洞察を得るための基盤となります。

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Transaction_ID             1000 non-null   category
 1   Transaction_Date           1000 non-null   datetime64[ns]
 2   Member_ID                  1000 non-null   category
 3   Product_ID                 1000 non-null   category
 4   Store_ID                   1000 non-null   category
 5   Quantity                   1000 non-null   int64
 6   Sales_Amount               1000 non-null   int64
 7   Transaction_Date_yyyyMMdd  1000 non-null   object
 8   Month                      1000 non-null   period[M]
 9   Day_of_Week                1000 non-null   object
dtypes: category(4), datetime64[ns](1), int64(2), object(2), period[M](1)
memory usage: 106.5+ KB

29. 1週間ごとに合計Amountを集計してください

In [266]:
# weekdayだと各曜日が数値に変換されて、曜日ごと集計される(0:月、1:火、2:水...)
WeekDay = sales_df_my_work['Transaction_Date'].dt.weekday
print(WeekDay.unique(), WeekDay.nunique())
sales_df_my_work.groupby(WeekDay)['Sales_Amount'].sum()

[2 3 4 5 6 0 1] 7

Transaction_Date
0    718500
1    722500
2    842100
3    791900
4    745700
5    752300
6    765100
Name: Sales_Amount, dtype: int64

In [267]:
# 解答例
sales_df_my_work['Week'] = sales_df_my_work['Transaction_Date'].dt.to_period('W')
# sales_df_my_work['Week'] = sales_df_my_work['Transaction_Date'].dt.weekday
sales_df_my_work.groupby('Week')['Sales_Amount'].sum()

Week
2024-04-29/2024-05-05    241100
2024-05-06/2024-05-12    311300
2024-05-13/2024-05-19    304900
2024-05-20/2024-05-26    309600
2024-05-27/2024-06-02    290600
2024-06-03/2024-06-09    312800
2024-06-10/2024-06-16    300100
2024-06-17/2024-06-23    281900
2024-06-24/2024-06-30    304400
2024-07-01/2024-07-07    319800
2024-07-08/2024-07-14    287600
2024-07-15/2024-07-21    309900
2024-07-22/2024-07-28    287500
2024-07-29/2024-08-04    316200
2024-08-05/2024-08-11    278900
2024-08-12/2024-08-18    343900
2024-08-19/2024-08-25    306600
2024-08-26/2024-09-01    231000
Freq: W-SUN, Name: Sales_Amount, dtype: int64

以下の2つのコードの違いを説明します。

```python
sales_df_my_work['Week'] = sales_df_my_work['Transaction_Date'].dt.to_period('W')
sales_df_my_work['Week'] = sales_df_my_work['Transaction_Date'].dt.weekday
```

### **1. `to_period('W')` の場合**
- **機能**: `to_period('W')` は、`Transaction_Date` を週単位の期間（`Period`型）に変換します。この場合、各日付が属する週を表します。
- **結果**: 各日付が「その週の開始日から終了日まで」を表す形式に変換されます（例: `2025-02-17/2025-02-23`）。週の終了日はデフォルトで日曜日です[1][4]。
- **用途**: データを「週単位」で集計したい場合に便利です。

**例**:
```python
# 2025年2月19日は、2025年2月17日（月）～2025年2月23日（日）の週に属する
2025-02-19 -> 2025-02-17/2025-02-23
```

---

### **2. `.weekday` の場合**
- **機能**: `.weekday` は、`Transaction_Date` の曜日を数値（整数）として取得します。月曜日が `0`、日曜日が `6` です[2][3]。
- **結果**: 各日付がその曜日に対応する数値に変換されます。
- **用途**: 曜日の情報を使いたい場合や、特定の曜日でフィルタリングしたい場合に使用します。

**例**:
```python
# 2025年2月19日は水曜日なので、数値としては 2 が返される
2025-02-19 -> 2
```

---

### **主な違い**
| 特徴                     | `to_period('W')`                          | `.weekday`            |
|--------------------------|-------------------------------------------|-----------------------|
| **目的**                 | 週単位の期間を取得                        | 曜日を数値で取得       |
| **出力形式**             | `Period` 型（例: `2025-02-17/2025-02-23`） | 整数（例: `0~6`）      |
| **用途**                 | 週単位での集計やグループ化                  | 曜日の分析や条件分岐    |
| **データ型**             | `Period[W-SUN]`                          | `int64`               |

### **まとめ**
- 週単位でデータを扱いたい場合は `to_period('W')` を使用。
- 曜日に基づく分析や条件分岐が必要な場合は `.weekday` を使用。

30. 1週間ごとのAmountの増減を計算し、増加率をパーセンテージで表示してください

In [268]:
sum_amount_per_week = sales_df_my_work.groupby(WeekDay)['Sales_Amount'].sum()
diff_amount_per_week = sum_amount_per_week.diff().abs()
diff_amount_per_week = diff_amount_per_week.dropna()
print(diff_amount_per_week)

# 増減率はわからなかったので、調べてみる
# 増減率 = (後の値 - 前の値) / 前の値

sum_amount_per_week.reset_index().diff().abs()

sum_amount_per_week.reset_index().pct_change()*100

Transaction_Date
1      4000.0
2    119600.0
3     50200.0
4     46200.0
5      6600.0
6     12800.0
Name: Sales_Amount, dtype: float64

   Transaction_Date  Sales_Amount
0               NaN           NaN
1               inf      0.556715
2        100.000000     16.553633
3         50.000000     -5.961287
4         33.333333     -5.834070
5         25.000000      0.885074
6         20.000000      1.701449

In [269]:
# LLMが回答
# Calculate the week-over-week percentage change in Sales_Amount
percentage_change_per_week = sum_amount_per_week.pct_change().dropna() * 100

# Display the result
print(percentage_change_per_week)

Transaction_Date
1     0.556715
2    16.553633
3    -5.961287
4    -5.834070
5     0.885074
6     1.701449
Name: Sales_Amount, dtype: float64

In [270]:
# 解答例
# (上でsales_df_my_work['Week'] = sales_df_my_work['Transaction_Date'].dt.to_period('W')をしているので、Weekが使える)
weekly_sales = sales_df_my_work.groupby('Week')['Sales_Amount'].sum().reset_index() # weekがindexになっているので、reset_indexを使って、indexを振り直す
weekly_sales['Sales_Amount'].pct_change()*100 # 前のサンプルとの差分の増加率が%で表示されている

0           NaN
1     29.116549
2     -2.055895
3      1.541489
4     -6.136951
5      7.639367
6     -4.060102
7     -6.064645
8      7.981554
9      5.059133
10   -10.068793
11     7.753825
12    -7.228138
13     9.982609
14   -11.796331
15    23.305844
16   -10.846176
17   -24.657534
Name: Sales_Amount, dtype: float64

### pct_change()の意味
```python
weekly_sales['Sales_Amount'].pct_change() * 100
```

#### `.pct_change()`
- Pandasの`pct_change()`メソッドは、**「前の行との相対的な変化率」** を計算します。
- 具体的には、以下の式で計算されます：
  $$
  \text{変化率} = \frac{\text{現在の値} - \text{前の値}}{\text{前の値}}
  $$
#### コード適用後
```python
weekly_sales['Sales_Amount'].pct_change() * 100
```

結果：
| Week | Sales_Amount | pct_change (%) |
|------|--------------|----------------|
|   1  |          200 | NaN            |
|   2  |          250 | (250-200)/200 *100 = **25.0** |
|   3  |          300 | (300-250)/250 *100 = **20.0** |
|   4  |          240 | (240-300)/300 *100 = **-20.0** |

---

### 注意点
1. **最初の行は常に`NaN`になる**  
   最初の行には比較する「前の値」が存在しないため、結果は`NaN`になります。

2. **ゼロ除算に注意**  
   前の値がゼロの場合、ゼロ除算エラーが発生する可能性があります。この場合、結果は`inf`やエラーになることがあります。

3. **目的**  
   このコードは、週ごとの売上金額（`Sales_Amount`）がどれだけ増減したかをパーセンテージで把握するために使われます。売上トレンドや成長率を分析する際に役立ちます。

---

### 応用例
もし、この結果を新しい列としてデータフレームに追加したい場合は、以下のように書けます：
```python
weekly_sales['Sales_Change_Percentage'] = weekly_sales['Sales_Amount'].pct_change() * 100
```

これによって、元データフレームに新しい列として変化率が追加されます。

31. 新しく作成したカラムを削除してください

In [271]:
# sales_df_my_work.columns
# 列方向から新しく作成したカラムを削除する
sales_df_my_work.drop(columns=['Transaction_Date_yyyyMMdd', 'Month', 'Day_of_Week', 'Week'], axis=1, inplace=True)

sales_df_my_work

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5800
1,2,2024-05-01 02:55:00,107,23,17,1,600
2,3,2024-05-01 05:51:00,117,24,6,3,1300
3,4,2024-05-01 08:47:00,124,38,1,3,6000
4,5,2024-05-01 11:43:00,281,28,5,4,9400
...,...,...,...,...,...,...,...
995,996,2024-08-30 12:16:00,213,33,15,3,8400
996,997,2024-08-30 15:12:00,62,49,19,3,3900
997,998,2024-08-30 18:08:00,49,12,11,4,2500
998,999,2024-08-30 21:04:00,127,11,15,3,4200
999,1000,2024-08-31 00:00:00,223,5,12,2,7500

In [101]:
# 新しく作成したカラムを削除
# sales_df_my_work = sales_df_my_work.drop(columns=['OnlyDate', 'OnlyMonth', 'WeekDay']) # カラムには追加していないので必要ない？

32. Amount が1000円を超える取引を抽出し、Store_ID と Product_ID ごとに Amount の合計を計算してください

In [273]:
# # amount_over_1000 = sales_df_my_work[sales_df_my_work['Sales_Amount'] > 1000].head() # ここでheadをしてしまっているので、データが5行のみになってしまっていた
# amount_over_1000 = sales_df_my_work[sales_df_my_work['Sales_Amount'] > 1000]
# # print(amount_over_1000['Store_ID'].unique())
# amount_over_1000.groupby('Store_ID')['Sales_Amount'].sum()

# # 複数のラベルでグループ化する方法はわからなかったので、調べてみる
# # amount_over_1000.groupby(['Store_ID', 'Product_ID'])['Sales_Amount'].sum()
# # sales_df_my_work['Store_ID'].nunique()

In [103]:
# LLMが回答
# Extract transactions where Sales_Amount is greater than 1000
amount_over_1000 = sales_df_my_work[sales_df_my_work['Sales_Amount'] > 1000]

# Calculate the sum of Sales_Amount for each combination of Store_ID and Product_ID
sum_amount_per_store_product = amount_over_1000.groupby(['Store_ID', 'Product_ID'])['Sales_Amount'].sum()

# Display the result
print(sum_amount_per_store_product)

Store_ID  Product_ID
1         1              9500
          2                 0
          3             20300
          4              3800
          5             12500
                        ...
20        46             1100
          47             9500
          48                0
          49            15200
          50                0
Name: Sales_Amount, Length: 1000, dtype: int64

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/3207405890.py:6: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sum_amount_per_store_product = amount_over_1000.groupby(['Store_ID', 'Product_ID'])['Sales_Amount'].sum()

In [274]:
# 解答例
filtered_sales_df = sales_df_my_work.query("Sales_Amount > 1000")
# Keyは二つなのでリストに入れる
filtered_sales_df.groupby(["Store_ID", "Product_ID"])["Sales_Amount"].sum()

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/2028459852.py:4: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  filtered_sales_df.groupby(["Store_ID", "Product_ID"])["Sales_Amount"].sum()

Store_ID  Product_ID
1         1              9500
          2                 0
          3             20300
          4              3800
          5             12500
                        ...
20        46             1100
          47             9500
          48                0
          49            15200
          50                0
Name: Sales_Amount, Length: 1000, dtype: int64

33. Store_ID ごとの合計Amountを集計し300000円以上の店舗を抽出してください

In [286]:
sum_amount_per_storeid = sales_df_my_work.groupby('Store_ID')['Sales_Amount'].sum()
# この時点でSales_Amountのラベルは取れてしまう ※

sum_amount_per_storeid[sum_amount_per_storeid > 300000]
# sum_amount_per_storeid.head()

# ここからはわからなかったので、調べてみる
sum_amount_per_storeid[sum_amount_per_storeid > 300000].index # Store_IDのみ取得 # これが条件になる
sales_df_my_work[sales_df_my_work['Store_ID'].isin(sum_amount_per_storeid[sum_amount_per_storeid > 300000].index)].head()




# 解答例のやり方と同じ結果になる
# ※ 2025/02/22 解説を読んだ時のメモ：reset_index()で"Sales_Amount"のラベルも復活した状態になる
sum_amount_per_storeid = sum_amount_per_storeid.reset_index()
sum_amount_per_storeid[sum_amount_per_storeid['Sales_Amount'] > 300000]

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/649708730.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sum_amount_per_storeid = sales_df_my_work.groupby('Store_ID')['Sales_Amount'].sum()

   Store_ID  Sales_Amount
7         8        331600
12       13        343100
14       15        357500
16       17        326200

In [276]:
# LLMが回答
# Calculate the sum of Sales_Amount for each Store_ID
sum_amount_per_storeid = sales_df_my_work.groupby('Store_ID')['Sales_Amount'].sum()

# Filter Store_IDs with Sales_Amount greater than 300000
store_ids_over_300k = sum_amount_per_storeid[sum_amount_per_storeid > 300000].index

# Filter the original DataFrame to include only rows with Store_IDs in store_ids_over_300k
filtered_sales_df = sales_df_my_work[sales_df_my_work['Store_ID'].isin(store_ids_over_300k)]

print(filtered_sales_df)

    Transaction_ID    Transaction_Date Member_ID Product_ID Store_ID  \
1                2 2024-05-01 02:55:00       107         23       17
14              15 2024-05-02 17:01:00        27         44       15
18              19 2024-05-03 04:45:00       291          3       13
21              22 2024-05-03 13:32:00       106         15       15
28              29 2024-05-04 10:03:00       263         36        8
..             ...                 ...       ...        ...      ...
981            982 2024-08-28 19:14:00        39         23       15
989            990 2024-08-29 18:41:00       166         50       17
992            993 2024-08-30 03:29:00        81         18       13
995            996 2024-08-30 12:16:00       213         33       15
998            999 2024-08-30 21:04:00       127         11       15

     Quantity  Sales_Amount
1           1           600
14          1          3300
18          2          6500
21          4          9400
28          1          8600
..        ...           ...
981         1          3200
989         2          5100
992         3          7600
995         3          8400
998         3          4200

[253 rows x 7 columns]

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/672145190.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sum_amount_per_storeid = sales_df_my_work.groupby('Store_ID')['Sales_Amount'].sum()

In [281]:
# 解答例
sum_amount_per_storeid = sales_df_my_work.groupby('Store_ID')['Sales_Amount'].sum().reset_index()
sum_amount_per_storeid.query("Sales_Amount > 300000")

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/274318434.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sum_amount_per_storeid = sales_df_my_work.groupby('Store_ID')['Sales_Amount'].sum().reset_index()

   Store_ID  Sales_Amount
7         8        331600
12       13        343100
14       15        357500
16       17        326200

34. 会員ごとに取引回数をカウントしてください

In [106]:
# よくわからなかった
# sales_df_my_work.info()
# member_df.info()

sales_df_my_work.groupby('Member_ID')['Sales_Amount'].sum()
# sales_df_my_work['Member_ID'].unique()

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/2921439769.py:5: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sales_df_my_work.groupby('Member_ID')['Sales_Amount'].sum()

Member_ID
1      10000
2      23600
3      20400
4       5200
5      18100
       ...
295    23500
296     9400
297    10900
298     9400
300    11800
Name: Sales_Amount, Length: 288, dtype: int64

In [107]:
# LLMが回答
transaction_count_per_member = sales_df_my_work.groupby('Member_ID').size()
print(transaction_count_per_member)

Member_ID
1      2
2      4
3      4
4      2
5      4
      ..
295    3
296    1
297    2
298    1
300    2
Length: 288, dtype: int64

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/1233865452.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  transaction_count_per_member = sales_df_my_work.groupby('Member_ID').size()

In [297]:
# 解答例
# Member_IDごとにTransaction_IDをカウント
# sales_df_my_work.groupby("Member_ID")["Transaction_ID"].count()
sales_df_my_work.groupby('Member_ID')['Transaction_ID'].count().reset_index()

# sales_df_my_work['Transaction_ID'].count()

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/1783418548.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sales_df_my_work.groupby('Member_ID')['Transaction_ID'].count().reset_index()

    Member_ID  Transaction_ID
0           1               2
1           2               4
2           3               4
3           4               2
4           5               4
..        ...             ...
283       295               3
284       296               1
285       297               2
286       298               1
287       300               2

[288 rows x 2 columns]

35. 会員ごとに取引回数をカウントし、2回以上の取引がある会員を抽出してください

In [108]:
# transaction_count_per_member.head()
transaction_count_per_member[transaction_count_per_member >= 2] # .nunique()

Member_ID
1      2
2      4
3      4
4      2
5      4
      ..
293    3
294    2
295    3
297    2
300    2
Length: 252, dtype: int64

In [305]:
# 解答例
member_transaction_count = sales_df_my_work.groupby('Member_ID')['Transaction_ID'].count().reset_index()
judge_num = 2 # 試しにクエリで変数を使うために定義
member_transaction_count.query("Transaction_ID >= @judge_num")

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/4123597452.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  member_transaction_count = sales_df_my_work.groupby('Member_ID')['Transaction_ID'].count().reset_index()

    Member_ID  Transaction_ID
0           1               2
1           2               4
2           3               4
3           4               2
4           5               4
..        ...             ...
281       293               3
282       294               2
283       295               3
285       297               2
287       300               2

[252 rows x 2 columns]

36. 年齢グループ（-30歳、31-50歳、51-65歳、66歳-）を作成し、各グループの会員数を集計してください。

In [109]:
# member_df.info()
# member_df['Age'].unique()
age_under_30 = member_df[member_df['Age'] <= 30]
age_31to50 = member_df[(member_df['Age'] >= 31) & (member_df['Age'] <= 50)]
age_over_66 = member_df[member_df['Age'] >= 66]

# member_df.groupby(['age_under_30', 'age_31to50', 'age_over_66'])[('Member_ID')].size()
print(age_under_30['Member_ID'].nunique(), age_31to50['Member_ID'].nunique(), age_over_66['Member_ID'].nunique())

49 103 89

In [110]:
# LLMが回答
age_under_30 = member_df[member_df['Age'] <= 30]
age_31to50 = member_df[(member_df['Age'] >= 31) & (member_df['Age'] <= 50)]
age_over_66 = member_df[member_df['Age'] >= 66]

# Concatenate the DataFrames
age_groups = pd.concat([age_under_30, age_31to50, age_over_66])

# Create a new column to categorize the age groups
age_groups['Age_Group'] = pd.cut(age_groups['Age'], bins=[0, 30, 50, 65, 100], labels=['-30歳', '31-50歳', '51-65歳', '66歳-'])

# Group by the new age group column and count the number of members in each group
age_group_counts = age_groups.groupby('Age_Group')['Member_ID'].size()
print(age_group_counts)

Age_Group
-30歳       49
31-50歳    103
51-65歳      0
66歳-       89
Name: Member_ID, dtype: int64

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/1202535488.py:13: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  age_group_counts = age_groups.groupby('Age_Group')['Member_ID'].size()

In [311]:
# 解答例
# 年齢の区切りを作成
# age_bins = [min(member_df['Age']), 30, 50, 65, max(member_df['Age'])]
age_bins = [min(member_df['Age'])-1, 30, 50, 65, max(member_df['Age'])]
# 各年代のラベル(名前)を作成
age_labels = ["-30", "31-50", "51-65", "66-"]
# 定義したbinsに沿ってデータを区切り、ラベルも付与してくれるcut関数を使用
# pd.cut(member_df['Age'], bins=age_bins, labels=age_labels) # 各サンプルがどのbinsに属するかを返す
member_df['Age_Group'] = pd.cut(member_df['Age'], bins=age_bins, labels=age_labels) # 新しいカラムに格納
member_df.groupby('Age_Group')['Member_ID'].count().reset_index() # Age_GroupごとにMember_IDをカウント

# Age_GroupにNaNが含まれる原因
# cut関数はbinsの値の+1の部分を見ている
# 例: min+1~, 30+1~, 50+1~, 65+1~
# なので、minのサンプルは含まれずにNaNになってしまうので、-1をする

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/791295809.py:10: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  member_df.groupby('Age_Group')['Member_ID'].count().reset_index()

  Age_Group  Member_ID
0       -30         49
1     31-50        103
2     51-65         59
3       66-         89

37. 会員になってからの日数（Days_Since_Registration）のグループ（〜1年、1年〜2年, 2年〜）を作成し、各グループの会員数を集計してください

In [111]:
# # Daysからyearにする方法がわからなかった
# member_df['Days_Since_Registration'].head() # .info()
# # pd.to_datetime(member_df['Registration_Date']) - pd.to_datetime('2024-08-01')

# # member_df['Days_Since_Registration'].describe()
# member_df[member_df['Days_Since_Registration'] == 1]

    Member_ID Gender  Age  Days_Since_Registration
161       162   Male   72                        1

In [317]:
# # LLMが回答
# # Create bins for the days since registration
# bins = [0, 365, 710, float('inf')] # DataFrameの最小値を含まないように境界値を設定
# labels = ['〜1年', '1年〜2年', '2年〜']

# # Create a new column in member_df to categorize the days since registration
# member_df['Registration_Group'] = pd.cut(member_df['Days_Since_Registration'], bins=bins, labels=labels) # binsで指定した境界値でグループ化

# # Group by the new registration group column and count the number of members in each group
# registration_group_counts = member_df.groupby('Registration_Group')['Member_ID'].size() # グループごとにメンバー数をカウント
# registration_group_counts

# # nunique(), size()は結果が異なる。おそらく、nunique()は各Member_IDの種類なので、1とかになってしまう？
# # registration_group_counts = member_df.groupby('Registration_Group')['Member_ID'].nunique() # グループごとにユニークなメンバー数をカウント
# # registration_group_counts.reset_index()

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/4268843528.py:10: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  registration_group_counts = member_df.groupby('Registration_Group')['Member_ID'].size() # グループごとにメンバー数をカウント

Registration_Group
〜1年       52
1年〜2年     50
2年〜      198
Name: Member_ID, dtype: int64

In [315]:
# 解答例
year_bins = [min(member_df['Days_Since_Registration'])-1, 365, 710, max(member_df['Days_Since_Registration'])]
year_labels = ["-1年", "1年-2年", "2年-"]
member_df['Year_Group'] = pd.cut(member_df['Days_Since_Registration'], bins=year_bins, labels=year_labels) # 新しいカラムに格納
member_df.groupby('Year_Group')['Member_ID'].count().reset_index() # Year_GroupごとにMember_IDをカウント

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/3149870032.py:5: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  member_df.groupby('Year_Group')['Member_ID'].count().reset_index() # Year_GroupごとにMember_IDをカウント

  Year_Group  Member_ID
0        -1年         52
1      1年-2年         50
2        2年-        198

In [112]:
# Cut関数の動作確認
# Cut関数はList型で指定した境界値で区切る（以下のように1つの数字の場合は、分割数の指定になる）

# member_df['Registration_Group'].nunique() # value_counts()
ser = [11, 46, 65, 34, 25, 12, 35, 79]
# pd.cut(ser, 4) # 4分割する (17ずつに分ける)
pd.cut(ser, 4).value_counts()

# pd.DataFrame(ser, columns=['Age']).sum()/17 # mean()


# 年齢, どこの範囲に含まれるか
test_age_list = pd.DataFrame([], columns=['Age'])
test_age_list['Age'] = pd.Series([0,20,32,21,15,40,12,35,32,39,24,58,57,11,52,54,19])
test_split_age_list = pd.cut(test_age_list['Age'], bins=[-1,19,39,59]) # Cut関数は各サンプルをどの範囲に含むかを示すラベルを返す
test_age_list['Split_age'] = test_split_age_list
print(test_age_list)

    Age Split_age
0     0  (-1, 19]
1    20  (19, 39]
2    32  (19, 39]
3    21  (19, 39]
4    15  (-1, 19]
5    40  (39, 59]
6    12  (-1, 19]
7    35  (19, 39]
8    32  (19, 39]
9    39  (19, 39]
10   24  (19, 39]
11   58  (39, 59]
12   57  (39, 59]
13   11  (-1, 19]
14   52  (39, 59]
15   54  (39, 59]
16   19  (-1, 19]

38. 売上データと会員データを結合しmerged_dfとして定義してください

In [323]:
# pd.mergeとpd.concatは同じように見えるが、異なる動作をする。
# 今回の場合だと、Member_IDが重複してしまう。
# mergeは、onでどのデータをもとに結合するかを指定するので、重複しない。

# merged_df = pd.merge(sales_df_my_work, member_df, on='Member_ID', how='inner')
# merged_df.head()

merged_df = pd.concat([sales_df_my_work, member_df], axis=1)
merged_df.columns.value_counts()

Member_ID                  2
Transaction_ID             1
Transaction_Date           1
Product_ID                 1
Store_ID                   1
Quantity                   1
Sales_Amount               1
Gender                     1
Age                        1
Days_Since_Registration    1
Age_Group                  1
Year_Group                 1
Registration_Group         1
Name: count, dtype: int64

In [328]:
# 解答例
# pd.mergeとpd.concatは同じように見えるが、異なる動作をする。
# 今回の場合だと、Member_IDが重複してしまう。
# mergeは、onでどのデータをもとに結合するかを指定するので、重複しない。
# 注意点：結合時に指定するデータ(on=)は、型が違うと同じデータととみなされないので注意
merged_df = pd.merge(sales_df_my_work, member_df, on='Member_ID')
merged_df # .columns.value_counts()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount,Gender,Age,Days_Since_Registration,Age_Group,Year_Group,Registration_Group
0,1,2024-05-01 00:00:00,21,25,12,3,5800,Female,58,323,51-65,-1年,〜1年
1,2,2024-05-01 02:55:00,107,23,17,1,600,Male,71,1665,66-,2年-,2年〜
2,3,2024-05-01 05:51:00,117,24,6,3,1300,Male,56,751,51-65,2年-,2年〜
3,4,2024-05-01 08:47:00,124,38,1,3,6000,Male,73,1798,66-,2年-,2年〜
4,5,2024-05-01 11:43:00,281,28,5,4,9400,Male,70,333,66-,-1年,〜1年
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,2024-08-30 12:16:00,213,33,15,3,8400,Female,64,698,51-65,1年-2年,1年〜2年
996,997,2024-08-30 15:12:00,62,49,19,3,3900,Female,50,1600,31-50,2年-,2年〜
997,998,2024-08-30 18:08:00,49,12,11,4,2500,Male,29,1100,-30,2年-,2年〜
998,999,2024-08-30 21:04:00,127,11,15,3,4200,Female,49,1134,31-50,2年-,2年〜
999,1000,2024-08-31 00:00:00,223,5,12,2,7500,Male,70,409,66-,1年-2年,1年〜2年

39. 性別 ごとに 平均Amount を計算してください

In [330]:
# merged_df.info()
merged_df.groupby('Gender')['Sales_Amount'].mean()

Gender
Female    5373.939394
Male      5302.970297
Name: Sales_Amount, dtype: float64

In [332]:
# 解答例
# 結合する前は、性別は会員データ、Amountは売り上げデータだったので、マージしたからこそ扱える操作になる
merged_df.groupby('Gender')['Sales_Amount'].mean().reset_index()

   Gender  Sales_Amount
0  Female   5373.939394
1    Male   5302.970297

40. 性別ごとの平均 Quantity を集計してください

In [120]:
merged_df.groupby('Gender')['Quantity'].mean()

Gender
Female    2.616438
Male      2.564935
Name: Quantity, dtype: float64

In [333]:
# 解答例
# 結合する前は、性別は会員データ、Quantityは売り上げデータだったので、マージしたからこそ扱える操作になる
merged_df.groupby('Gender')['Quantity'].mean().reset_index()

   Gender  Quantity
0  Female  2.529293
1    Male  2.572277

41. 性別と店舗IDごとに取引数を集計してください

42. Store_ID が [1, 5, 9] の取引を抽出し、Store_ID ごとに Quantity の合計を計算してください

43. データセットの最後の10日間の取引を抽出し、Transaction_Date ごとにAmountを集計してください

44. 合計Amountが最も高い会員トップ5を特定してください

45. 会員ごとに最も新しい取引を集計してください

46. 会員ごとに最も古い取引を集計してください

47. 会員ごとに取引日時の最も古いデータと最も新しいデータを集計し、それぞれが違うレコードを抽出してください

48. Member_ID に「2」が含まれる会員の取引を抽出してください。

49. Product_ID が「1」で始まる取引を抽出してください。

50. Store_ID が「5」で終わる取引を抽出してください

51. Transaction_ID が奇数の取引を抽出してください

52. Member_ID が3桁の会員の取引を抽出してください

53. Member_ID に「1」と「3」が連続して含まれる取引を抽出してください

54. Member_ID が「1」で始まり、任意の数字が続く会員の取引を抽出してください

55. Product_IDごとの Quantityの最頻値を集計し、最頻値が3以上の商品を抽出してください

56. Product_IDごとのQuantityの最頻値を計算し、最頻値が最大の商品を抽出してください

57. Store_ID ごとにAmountの分散を計算し、分散が大きい順にソートしてください

58. Member_ID ごとにAmountの標準偏差を計算し、標準偏差が4000以上の会員を抽出してください

59. 会員データにおいて年齢ごとに会員数を集計し、会員数が多い順にソートしてください

60. 会員データの年齢の中央値を計算し、それより上の会員を抽出してください

61. Amountの大きいものから順番にランクを付与した上で昇順で並び替えてください。また同じAmountの場合は先に出現したものに高いランクを付与してください。

62. Member_ID ごとの合計Amountに対して、パーセンタイル値を計算して低い順に並び替えてください

63. 年代を縦（行）、性別を横（列）に持つテーブルで、各セグメントごとの平均取引金額を集計してください

64. 前の課題のテーブルを、年代と性別が縦に並ぶように変換してください

65. 年代✕性別のごとの取引回数を集計し表示してください

66. Amount が2000円以上なら 1、それ未満なら 0 を割り振ったフラグを新しいカラムに追加してください

67. Quantity の平均値以上の取引に 1、それ未満に 0 のフラグを追加してください

68. 顧客ごとの合計Amountに基づいて、〜25%点、〜50%点、〜75%点、〜100%点ごとに4つのカテゴリに分け、そのカテゴリを新しいカラムとして追加してください

69. Quantityが小さい順に等しく3つのカテゴリに分け、そのカテゴリを新しいカラムに追加してください

70. Gender カラムをダミー変数化してください

71. Amount カラムを標準化して新しいカラムを追加してください

72. 取引データ全体のうち10%をランダムにサンプリングしてください

73. 会員データの20%をランダムにサンプリングしてください

74. Amount が5000円以上の取引からランダムに5件をサンプリングしてください

75. Gender を層化基準にして取引データから20%抽出してください

76. Amount の平均から1σ以上離れた取引を外れ値として抽出してください（本来は3σ）

77. 現在のmember_dfをCSVファイルとして出力をしてください

78. seaborn を使って、merged_dfの数値カラム間の相関行列をヒートマップで可視化してください

79. plotlyを使って、merged_dfの数値カラム間の相関行列をヒートマップで可視化してください

80. matplotlib を使って、月ごとの合計Amountを棒グラフで表示してください

81. seaborn を使って、Store_ID ごとの取引数をカウントプロットで可視化してください

82. seaborn を使って、Store_ID ごとの合計Amountを棒グラフで表示してください

83. Plotlyを使って会員ごとの取引数を可視化してください

84. matplotlib を使って、日ごとの売上金額を折れ線グラフで表示してください

85. seaborn を使って、Amount の分布を箱ひげ図で表示してください

86. Days_Since_Registration に基づく顧客の分布を plotly の箱ひげ図で可視化してください

87. matplotlib を使って、Amount と Days_Since_Registration の関係を散布図で表示してください

88. plotly を使って、Days_Since_Registration と Amount の関係を散布図で表示してください。Store_IDごとに色を変えてください

89. seaborn の pairplot を使って、merged_dataの数値カラムの相関をペアプロットで可視化してください

90. plotly を使って、Product_ID ごとの売上と販売数量をバブルチャートで表示してください。Product_IDがX軸でAmountがY軸、そしてQuantityがバブルの大きさになるようにしてください

91. Amount カラムの分布をカーネル密度推定プロットで可視化してください

92. seaborn の regplot を使って、Amount と Days_Since_Registration の散布図に回帰直線を追加して可視化してください

93. seaborn の jointplot を使って、Amount と Days_Since_Registration の相関をヒストグラムと散布図を組み合わせた形で可視化してください

94. seaborn の violinplot を使って、Store_IDが1,3,5 の Quantity の分布を Violinプロットで可視化してください

95. matplotlib を使って、店舗ごとの売上合計をエリアチャートで可視化してください

96. matplotlib を使って、Store_ID ごとの売上を円グラフ（パイチャート）で可視化してください

97. Store_ID ごとの売上合計を plotly の円グラフ（パイチャート）で可視化してください

98. 取引日 ごとの売上累積を plotly のエリアチャートで可視化してください

99. Amount の分布を plotly のヒストグラムで可視化してください

100. Age と Days_Since_Registration の関係を散布図で可視化し、色分けを性別（Gender）に基づいて行ってください